import React, {useState, useEffect} from "react";
import './understanding_dushen.css'
import {Col, Row, Container} from "react-bootstrap"

const UnderstandingDushen =()=>{

    const exitPanel =(name, href, namehref, namePanel)=>{
        return(
            <div className="wrapper_exit_menu">
            <h2>{name}</h2>
            <div className="exit_menu_a_plus_text">

            <p><a href={href}>{namehref}</a></p>
            <p><span class="material-icons">arrow_right</span></p>
            <p>{namePanel}</p>
            </div>
        </div>
        )
    }


    return(
        <div className="understanding_dushen_wrapper">
             {exitPanel('Розуміння М’язової дистрофії Дюшена','/main','Про Нас ', '  Розуміння М’язової дистрофії Дюшена')}
             <Container>
                    <div className="understanding_dushen_text">
                        <h4>
                        М’язова дистрофія Дюшена
                        </h4>
                    <p>
                        Є найбільш поширеним фатальним генетичним захворюванням, яке як правило діагностується 
                        в ранньому дитячому віці і зачіпає приблизно 1 з кожних 3 500 новонароджених хлопчиків (близько 20 000 нових випадків щороку в усьому світі). 
                        Оскільки ген Дистрофін розміщується на Х-хромосомі, 
                        в першу чергу це захворювання зачіпає хлопчиків, незалежно від раси і культури.
                    </p>
                    <p>
                        М’язова дистрофія Дюшена викликана мутацією в гені, який кодує дистрофін *. 
                        Оскільки дистрофін * відсутній, м’язові клітини легко пошкоджуються, що призводить до поступової втрати витривалості і м’язової слабкості. 
                        М’язова дистрофія Дюшена призводить також до серйозних медичних проблем, особливо проблем серця і легенів. Молоді люди при МДД зазвичай доживають до 20 років,
                        однак, за останні десятиліття, завдяки своєчасної діагностики
                        та правильного ведення захворювання медичним персоналом і з огляду на щоденні потреби хворого, якість і тривалість життя значно збільшилася.
                    </p>
                    <p>
                    М’язова дистрофія Дюшена може передаватися від батьків до дитини, але приблизно 35% випадків відбуваються через спонтанну мутацію. 
                    Іншими словами, це може торкнутися будь-кого. Незважаючи на те, що на сьогоднішній 
                    день існують медичні методи лікування, які можуть уповільнити процес прогресування захворювання, в даний час ліків для повного зцілення від МДД не існує.
                    </p>
                    </div>
  
                <div className="img_understanding_dushen">
                       <img src="http://miolife.org/wp-content/uploads/2019/06/a4-05-2stor-02-768x1086.jpg" alt="alt" />  
                    <img  src="http://miolife.org/wp-content/uploads/2019/06/a4-05-1stor-01.jpg" alt="alt" />
                </div>
                </Container>
        </div>
    )
}


export default UnderstandingDushen;